app/controllers/songs_controller.rb

  def index
    artist = Artist.find_by_id(params[:artist_id])
    if !artist && !!params[:artist_id]
      flash[:alert] = "Artist not found."
      redirect_to artists_path
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs"

  def show
    @artist = Artist.find_by_id(params[:artist_id]) if params[:artist_id] || @artist = Song.find_by_id(params[:id]).artist
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]